my_code/app/views/shops/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id %>
    <%= form.select :category_id, Category.all.map{|o| [o.name, o.id]} %>