my_code/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (name LIKE '%haru%')
SELECT "articles".* FROM "articles"
---
  def index
    if params[:name_key]
      @articles = Article.where('name LIKE ?', "%#{params[:name_key]}%")
    else
      @articles = Article.all

INSERT INTO "articles" ("content", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)  [["content", "hello"], ["created_at", "2017-10-13 06:14:55.897446"], ["updated_at", "2017-10-13 06:14:55.897446"], ["name", "haru"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "hello word"], ["updated_at", "2017-10-14 07:06:57.130008"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)