my_code/app/controllers/shops_controller.rb

  def index
    if params[:name_key]
      @shops = Shop.where('name LIKE ?', "%#{params[:name_key]}%")
    else
      @shops = Shop.all
---
SELECT "shops".* FROM "shops" WHERE (name LIKE '% ラーメン %')
SELECT "shops".* FROM "shops"

  def create
    @shop = Shop.new(shop_params)

    respond_to do |format|
      if @shop.save
---
INSERT INTO "shops" ("category_id", "name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["name", "パイザ亭"], ["address", ""], ["created_at", "2017-10-14 10:27:46.916879"], ["updated_at", "2017-10-14 10:27:46.916879"]]

  def update
    respond_to do |format|
      if @shop.update(shop_params)
---
UPDATE "shops" SET "category_id" = ?, "updated_at" = ? WHERE "shops"."id" = ?  [["category_id", 2], ["updated_at", "2017-10-14 11:01:41.919228"], ["id", 1]]

    def set_shop
      @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]